Repository: bksubhuti/buddhist_compass
Catalog: lib/l10n/app_*.arb
Languages: km, my, si

# appTitle
source: Buddhist Compass App
km: កម្មវិធីកំពែងព្រះពុទ្ធ
my: အပလီကေးရှင်းအမည်
si: බුද්ධස්ථාන දිශානතිය සොයන්නා

# drawerHeaderTitle
source: Buddhist Compass
km: កំពែងព្រះពុទ្ធ
my: ဗုဒ္ဓဦးတည်မြေပုံ
si: බුද්ධස්ථාන දිශානතිය

source: Help
km: ជំនួយ
my: အကူအညီ
si: උදව්

source: About
km: អំពី
my: အကြောင်းအရာ
si: මෘදුකාංගය ගැන

source: Privacy Policy
km: គោលនយោបាយភាពឯកជន
my: ကိုယ်ရေးအချက်အလက်ရေးရာမူဝါဒ
si: පෞද්ගලිකත්ව ප්‍රතිපත්තිය

source: Share App
km: ចែករំលែកកម្មវិធី
my: အက်ပ်မျှဝေပါ
si: මෘදුකාංගය බෙදාගැනීම

source: Current Direction:
km: ទិសបច្ចុប្បន្ន:
my: လက်ရှိဦးတည်ချက်:
si: වත්මන් දිශාව:

# bearingTo
source: Bearing to {targetName}:
km: ទិសទៅ {targetName}:
my: {targetName} ဦးတည်ရာ
si: {targetName} වෙත දිශාව:

# distanceTo
source: Distance to {targetName}:
km: ចម្ងាយទៅ {targetName}:
my: {targetName} ဦးတည်ရာအမည်
si: {targetName} දක්වා දුර:

source: Vibration
km: ការញ័រ
my: တုန်ခါမှု
si: කම්පන ප්‍රතිචාර

# helpDialogTitle
source: Help
km: ជំនួយ
my: အကူအညီ
si: උදව්

# helpDialogContent
source: 1. When the app first starts, it will ask permission to use your location. Allow access. 2. Select the Buddhist site you wish to face (default is Bodh Gaya, India). Wait a few seconds for it to register. 3. Hold your phone parallel to the ground and slowly turn until the compass aligns with your chosen site. 4. When you are facing the right direction, the compass becomes bright. 5. Pray in that direction. 6. Optionally, enable vibration mode for haptic feedback.
km: ១. នៅពេលកម្មវិធីចាប់ផ្តើម វានឹងសួរអនុញ្ញាតក្នុងការប្រើទីតាំងរបស់អ្នក។ សូមអនុញ្ញាត។ ២. ជ្រើសរើសទីកន្លែងព្រះពុទ្ធសាសនាដែលអ្នកចង់បង្ហាញមុខ (លំនាំដើមគឺពុទ្ធគាយា ប្រទេសឥណ្ឌា)។ រង់ចាំពីរបីវិនាទី។ ៣. កាន់ទូរស័ព្ទរបស់អ្នកឱ្យស្មើដី ហើយបង្វិលបន្តិចៗរហូតដល់កំពែងស្របជាមួយទីកន្លែងដែលបានជ្រើស។ ៤. នៅពេលអ្នកបង្ហាញទៅទិសត្រឹមត្រូវ កំពែងនឹងភ្លឺ។ ៥. អធិដ្ឋានទៅទិសនោះ។ ៦. ជាជម្រើស អាចបើកការញ័រដើម្បីមានអារម្មណ៍តាមដៃ។
my: ၁။ အက်ပ်ကိုစတင်သုံးရာတွင် တည်နေရာခွင့်ပြုချက် တောင်းခံပါလိမ့်မည်။ ခွင့်ပြုပါ။ ၂။ မိမိဦးတည်လိုသော ဗုဒ္ဓနေရာ (မူရင်းသည် ဗောဓိဂယာ၊ အိန္ဒိယ) ကို ရွေးချယ်ပါ။ စက်က အလားအလာများကိုဖော်ထုတ်ရန် အချိန်အနည်းငယ်စောင့်ပါ။ ၃။ ဖုန်းကို မြေပြင်နှင့်ညီအောင်ထားပြီး ဦးတည်ချက်ကိုမှန်အောင် ဖြေးဖြေးလှည့်ပါ။ ၄။ မိမိမှန်ကန်သော ဦးတည်ချက်သို့ရောက်သည်ဖြစ်လျှင် မြေပုံသည် တောက်ပလာမည်။ ၅။ ဤဦးတည်ချက်သို့ ဆုတောင်းပါ။ ၆။ လိုအပ်ပါက တုန်ခါမှုအချက်ပေးမှု ဖွင့်နိုင်သည်။
si: 1. ඇප් එක පළමුව ක්‍රියාත්මක වන විට, ඔබගේ වත්මන් ස්ථානය භාවිත කිරීමට අවසර ඉල්ලනු ඇත. ඒ සඳහා අවසරය ලබාදෙන්න. 2. ඔබ දිශානතිය බලාපොරොත්තු වන බෞද්ධ ස්ථානය තෝරන්න ( මූලික සැකසුම බෝධිගයා, ඉන්දියාව සඳහා සකසා ඇත). ලියාපදිංචි වීමට තත්පර කිහිපයක් රැඳෙන්න. 3. ඔබගේ දුරකථනය භූමියට සමාන්තරව තබා, ඔබ තෝරාගත් ස්ථානය සමඟ දර්ශකය (Compass) සමාන වන තුරු සෙමිහිට හැරෙන්න. 4. ඔබ සම්මත/නිවැරදි දිශාවට මුහුණ දෙමින් සිටින විට, දිශානතිය දීප්ත වේ. 5. එම දිශාවට මුහුණලා වන්දනාව සිදු කරන්න. 6.අවශ්‍ය නම්, ඔබ ඉලක්කය මත සිටින විටත් එයින් බැහැර වන විටත් සම්පීඩන ප්‍රතිචාර "වයිබ්බ්‍රේට්" සඳහා මාරුවීමට.

# helpDialogOk
source: OK
km: យល់ព្រម
my: အိုကေ
si: හරි

# aboutDialogTitle
source: Buddhist Compass
km: កំពែងព្រះពុទ្ធ
my: ဗုဒ္ဓဦးတည်မြေပုံ
si: බුද්ධස්ථාන දිශානතිය

# aboutDialogParagraph1
source: Buddhist Compass helps you align yourself with Bodh Gaya, the place of the Buddha’s Enlightenment, or other sacred sites. By facing these holy directions, your prayers and worship can feel more powerful and connected.
km: កំពែងព្រះពុទ្ធជួយអ្នកឱ្យបង្ហាញមុខទៅកាន់ពុទ្ធគាយា កន្លែងបត់ផ្ការព្រះពុទ្ធ ឬកន្លែងបរិសុទ្ធផ្សេងទៀត។ ដោយបង្ហាញទៅទិសទាំងនេះ ការអធិដ្ឋាន និងការគោរពរបស់អ្នកអាចមានអារម្មណ៍មានអានុភាព និងភ្ជាប់ចិត្ត។
my: ဗုဒ္ဓဦးတည်အက်ပ်က သင့်ကို ဗုဒ္ဓဂါယာ(ဘုရားပွင့်တဲ့နေရာ) သို့မဟုတ် အလေးအမြတ်နေရာတွေနဲ့ ချိန်ညှိပေးလိမ့်မယ်။ မင်းကအလေးအမြတ်နေရာကိုမျက်နှာမူပြီး ရှိခိုးခြင်းဖြင့် မင်းစိတ်ဆက်သွယ်မှုရှိလာပြီး စိတ်စွမ်းအားပိုကြီးလာမယ်
si: බෞද්ධ දිශානති මාලිමාව, ඔබට බුද්ධගයාව ,බුදුරජාණන් වහන්සේ බුද්ධත්වයට පත් වූ ස්ථානය හා අනෙකුත් ස්ථාන සමග මනා දිශානතියකින් යුතුව ස්ථාපිත වීමට උපකාර කරයි. එලෙස ඒ ඒ දිශාවන් මුහුණලා මනා සංඥාවක් ඇතිකොට වන්දනා කිරීමෙන්, ප්‍රාර්ථනා කිරීමෙන්, වැඩි කුසල ශක්තියක් ඇති කරගත හැක.

# aboutDialogParagraph2
source: The idea for this app came while traveling in Thailand, inspired by the way Muslims face Mecca in their daily prayers. Now, Buddhists too can easily find the direction of Bodh Gaya or other locations with a simple compass tool.
km: គំនិតសម្រាប់កម្មវិធីនេះបានកើតឡើងក្នុងពេលធ្វើដំណើរនៅប្រទេសថៃ ដោយទទួលបានការជំរុញចិត្តពីរបៀបដែលមូស្លីមបង្ហាញមុខទៅមកកា ក្នុងការអធិដ្ឋានប្រចាំថ្ងៃ។ ឥឡូវនេះ ពុទ្ធសាសនិកក៏អាចរកទិសនៃពុទ្ធគាយា ឬទីកន្លែងផ្សេងៗបានងាយស្រួល។
my: မျက်နှာမူပြီးနေ့စဉ်ရှိခိုးနေတာမြင်ပြီး ဒီအက်ပလီကေးရှင်းလုပ်ဖို့စိတ်ကူးပေါ်လာတာဖြစ်တယ်။ အခု ဗုဒ္ဓဘာသာဝင်တွေက်လည်း ဒီအက်ပလီကေးရှင်းကိုသုံးပြီး ဗုဒ္ဓဂါယာ သို့မဟုတ် အခြားတည်နေရာကိုလွယ်ကူစွာရှာနိုင်ပြီ
si: මෙවැනි මෘදුකාංගයක් ගැන අදහසක් මුලින්ම ඇති වූයේ තායිලන්තයේ සංචාරයක යෙදී සිටින විටයි. ඉස්ලාම් භක්තිකයින් මක්කම ඇති දිශාව අරමුණු කරගෙන දිනපතා වන්දනා කරන්නා සේ, දැන් බෞද්ධයන්ටත් ඉතා පහසුවෙන් තමන් වන්දනා කරන්නට බලාපොරොත්තු වන බුද්ධගයාව හා වෙනත් බෞද්ධ ස්ථානවල දිශානතිය මෙම සරල මෘදුකාංගයෙන් සොයා ගත හැක.

# aboutDialogParagraph3
source: How to Use: • Allow location permission when prompted. • Select Bodh Gaya or another Buddhist site. • Hold your phone flat and rotate until the compass aligns. • The compass will brighten when you face the right direction. • Pray in that direction. • Optional: enable vibration for haptic feedback.
km: របៀបប្រើ: • អនុញ្ញាតអោយប្រើទីតាំង។ • ជ្រើសរើសពុទ្ធគាយា ឬកន្លែងពុទ្ធសាសនាផ្សេង។ • កាន់ទូរស័ព្ទឱ្យស្មើដី ហើយបង្វិលរហូតដល់កំពែងស្រប។ • កំពែងនឹងភ្លឺនៅពេលបង្ហាញទៅទិសត្រឹមត្រូវ។ • អធិដ្ឋានទៅទិសនោះ។ • ជាជម្រើស៖ បើកការញ័រ។
my: သုံးစွဲနည်း: • တည်နေရာခွင့်ပြုချက် တောင်းခံပါက ခွင့်ပြုပါ။ • ဗုဒ္ဓဂါယာ သို့မဟုတ် အခြားဗုဒ္ဓနေရာတစ်ခုကို ရွေးပါ။ • ဖုန်းကို မြေပြင်နှင့်ထောင့်မှန်အောင်ထားပြီး ဦးတည်ချက်မှန်အောင် လှည့်ပါ။ • မှန်ကန်သောဦးတည်ချက်သို့ရောက်သည်နှင့် မြေပုံသည် တောက်ပလာမည်။ • ဤဦးတည်ချက်သို့ ဆုတောင်းပါ။ • လိုအပ်ပါက တုန်ခါမှု ဖွင့်နိုင်သည်။
si: භාවිතා කරන විදිහ: • ස්ථාන අවසරය ඉල්ලූ විට, එය ලබාදෙන්න. • බෝධිගයා හෝ වෙනත් බුද්ධ ස්ථානයක් තෝරන්න. • ඔබගේ දුරකථනය පොළොවට සමාන්තරව තබා ඔබ තෝරාගත් ස්ථානය සමඟ දර්ශකය සමානව ස්ථාපනය වනතුරු හෙමිහිට හැරෙන්න. • නිවැරදි දිශානතියට මුහුණලා සිටි කල්හි මෘදුකාංගය දීප්තිමත් වනු ඇත. • එම දිශාවට මුහුණලා වන්දනාව සිදු කරන්න. • කැමති නම්, සම්පීඩන ප්‍රතිචාර "වයිබ්බ්‍රේට්" සක්‍රීය කරන්න.

# aboutDialogParagraph4
source: We do not collect or store your personal location data. Only anonymous statistics provided by the app stores are used.
km: យើងមិនប្រមូល ឬរក្សាទុកទិន្នន័យទីតាំងផ្ទាល់ខ្លួនរបស់អ្នកឡើយ។ មានតែស្ថិតិនាមមិនស្គាល់ពីហាងកម្មវិធីប៉ុណ្ណោះ។
my: သင်၏တည်နေရာအချက်အလက်ကို ကျွန်ုပ်တို့ သိမ်းဆည်းခြင်းမပြုပါ။ App Store များမှရရှိသော မသိနိုင်သောစာရင်းဇယားများကိုသာ အသုံးပြုပါသည်။
si: ඔබ සිටින ස්ථානයට අදාල දත්ත එකතු කිරීමක් හෝ ගබඩා කිරීමක් අප විසින් සිදු නොකරයි.ඇප් ස්ටෝස් විසින් ලබා දෙන අන්‍යයන්‍යතාව රහිත සංඛ්‍යාන දත්ත පමණක් භාවිතා කරයි..

# locationPermissionRationaleTitle
source: Allow Location?
km: អនុញ្ញាតទីតាំង?
my: တည်နေရာခွင့်ပြုမလား?
si: ස්ථානයට අවසරද?

# locationPermissionRationaleMessage
source: Buddhist Compass needs your location to point toward your selected site.
km: កំពែងព្រះពុទ្ធត្រូវការទីតាំងរបស់អ្នក ដើម្បីបង្ហាញទៅកាន់កន្លែងដែលបានជ្រើស។
my: ဤအက်ပ်သည် သင့်ရွေးချယ်ထားသောနေရာကို ဦးတည်ရန် တည်နေရာအချက်အလက်လိုအပ်သည်။
si: ඔබ තෝරාගත් ස්ථානය වෙත දිශාව පෙන්වීමට බුද්ධ දිශානතියට ඔබේ ස්ථානය අවශ්‍ය වේ.

# locationPermissionRationaleNotNow
source: Not now
km: មិនមែនឥឡូវនេះ
my: အခုမလုပ်ပါ
si: දැන් නෙවෙයි

# locationPermissionRationaleContinue
source: Continue
km: បន្ត
my: ဆက်လက်လုပ်ဆောင်ရန်
si: දිගටයන්න

# locationRequiredTitle
source: Location Required
km: ត្រូវការទីតាំង
my: တည်နေရာလိုအပ်သည်
si: ස්ථානය අවශ්‍යයි

# locationRequiredCancel
source: Cancel
km: បោះបង់
my: ဖျက်သိမ်းမည်
si: අවලංගු කරන්න

# locationRequiredOpenSettings
source: Open Settings
km: បើកការកំណត់
my: ဆက်တင်များဖွင့်ရန်
si: සැකසුම් විවෘත කරන්න

# locationRequiredExit
source: Exit
km: ចាកចេញ
my: ထွက်ရန်
si: පිටවන්න

# locationRequiredMessage1
source: Location is required for the compass to work.
km: ត្រូវការទីតាំងសម្រាប់កំពែងដំណើរការ។
my: ဤမြေပုံအက်ပ်အလုပ်လုပ်စေရန် တည်နေရာလိုအပ်သည်။
si: දිශානතිය ක්‍රියාත්මක වීමට ස්ථානය අවශ්‍යයි.

# locationRequiredMessage2
source: Location permission is permanently denied. Enable it in Settings.
km: ការអនុញ្ញាតទីតាំងត្រូវបានបដិសេធជាអចិន្ត្រៃយ៍។ សូមបើកនៅក្នុងការកំណត់។
my: တည်နေရာခွင့်ပြုချက်ကို အမြဲပယ်ဖျက်ထားသည်။ ဆက်တင်တွင် ဖွင့်ပေးပါ။
si: ස්ථාන අවසරය ස්ථිරවම ප්‍රතික්ෂේප කර ඇත. සැකසුම්හිදී එය සක්‍රීය කරන්න.

# locationServicesTitle
source: Turn On Location Services
km: បើកសេវាទីតាំង
my: တည်နေရာဝန်ဆောင်မှုဖွင့်ရန်
si: ස්ථාන සේවා සක්‍රීය කරන්න

# locationServicesContent
source: Location Services are turned off. Turn them on in Settings to use the compass.
km: សេវាទីតាំងត្រូវបានបិទ។ សូមបើកនៅក្នុងការកំណត់ដើម្បីប្រើកំពែង។
my: တည်နေရာဝန်ဆောင်မှုများ ပိတ်ထားပါသည်။ သုံးရန်အတွက် ဆက်တင်တွင်ဖွင့်ပါ။
si: ස්ථාන සේවා සක්‍රීය නොවේ. දිශානතිය භාවිතා කිරීමට ඒවා සැකසුම්හිදී සක්‍රීය කරන්න.

# locationServicesNotNow
source: Not now
km: មិនមែនឥឡូវនេះ
my: အခုမလုပ်ပါ
si: දැන් නෙවෙයි

# locationServicesOpenSettings
source: Open Settings
km: បើកការកំណត់
my: ဆက်တင်ဖွင့်ရန်
si: සැකසුම් විවෘත කරන්න

# locationError
source: Unable to get location. Please try again.
km: មិនអាចយកទីតាំងបានទេ។ សូមព្យាយាមម្តងទៀត។
my: တည်နေရာရယူ၍မရပါ။ ထပ်မံကြိုးစားပါ။
si: ස්ථානය ලබාගැනීමට නොහැක. කරුණාකර නැවත උත්සාහ කරන්න.

# privacyPolicyError
source: Could not launch Privacy Policy
km: មិនអាចបើកគោលនយោបាយភាពឯកជនបានទេ
my: ကိုယ်ရေးမူဝါဒကို ဖွင့်၍မရပါ
si: පෞද්ගලිකත්ව ප්‍රතිපත්තිය විවෘත කළ නොහැක

# shareAppText
source: Buddhist Compass — find your direction: https://americanmonk.org/buddhist-compass
km: កំពែងព្រះពុទ្ធ — រកទិសរបស់អ្នក: https://americanmonk.org/buddhist-compass
my: ဗုဒ္ဓဦးတည်မြေပုံ — မိမိဦးတည်ရာကိုရှာဖွေပါ: https://americanmonk.org/apps/buddhist-compass/?utm_source=app&utm_medium=share
si: බුද්ධ දිශානතිය — ඔබේ දිශාව සොයන්න: https://americanmonk.org/buddhist-compass

# shareAppSubject
source: Buddhist Compass
km: កំពែងព្រះពុទ្ធ
my: ဗုဒ္ဓဦးတည်မြေပုံ
si: බුද්ධස්ථාන දිශානතිය

# shareAppTitle
source: Share Buddhist Compass
km: ចែករំលែកកំពែងព្រះពុទ្ធ
my: ဗုဒ္ဓဦးတည်မြေပုံမျှဝေပါ
si: බුද්ධ දිශානතිය බෙදාගන්න

# language
source: Select language
km: ជ្រើសរើសភាសា
my: ဘာသာစကားရွေးပါ
si: භාෂාව තෝරන්න

source: Settings
km: ការកំណត់
my: ဆက်တင်များ
si: සැකසුම්

source: Rate This App
km: វាយតម្លៃកម្មវិធីនេះ
my: အက်ပ်ကို အဆင့်သတ်မှတ်ပါ
si: මෙම යෙදුම ඇගයුම් කරන්න

# place_bodhGaya
source: Bodh Gaya
km: ពុទ្ធគាយា
my: ဗုဒ္ဓဂါယာ
si: බෝධිගයා

# place_shwedagonPagoda
source: Shwedagon Pagoda
km: បូជនីយដ្ឋានស្វេដាហ្គោន
my: ရွှေ တိဂုံစေတီတော်
si: ශ්වෙඩගෝන් පගොඩ

# place_select
source: Select place
km: ជ្រើសរើសកន្លែង
my: နေရာကိုရွေးပါ
si: ස්ථානයක් තෝරන්න

# place_lumbiniPagoda
source: Lumbini
km: លុំប៊ីនី
my: လုမ္ဗိနီ
si: ලුම්බිනි

# place_sarnath
source: Sarnath
km: សារណាថ
my: သာရနတ်
si: සාරනාත්

# place_kushinagar
source: Kushinagar
km: គុសិនគរ
my: ကုသိနာရုံ
si: කුසිනාරා

# place_mahaCetiya
source: Ruwanwelisaya
km: រុវនវេលីសាយ
my: မဟာစေတီ
si: රුවන්වැලිසැය

# place_toothRelicPagoda
source: Temple of the Tooth
km: វត្តធ្មេញ
my: စွယ်တော်စေတီ
si: දළදා මාළිගාව

source: Latitude
km: លាតិត្យូដ
si: අක්ෂාංශ

# longitude
source: Logiitude
km: ឡុងជីទ្យូដ
si: දේශාංශ

source: Location Name
km: ឈ្មោះទីតាំង
si: ස්ථානයේ නාමය

source: save
km: រក្សាទុក
si: සුරකින්න

source: clear
km: សម្អាត
si: මකන්න
